perf/seccion2/async-sync.yaml
config:
  environments:
    bbox-1:
      target: 'http://localhost:5555/bbox-1'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-bbox-1"
          
    bbox-2:
      target: 'http://localhost:5555/bbox-2'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-bbox-2"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Step1
      duration: 10
      arrivalRate: 1
    - name: Step2
      duration: 30
      arrivalRate: 5
    - name: Step3
      duration: 100
      arrivalRate: 10

scenarios:
  - name: Ping
    flow:
      - get:
          url: '/'